---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSetIterator.#ctor
source: html/c4e870ed-5e91-3beb-b200-e4d8a488a0f7.htm
---
# Autodesk.Revit.DB.FamilyTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public FamilyTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.